tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1719_tdd.h
#define CLC3GLS1_D3N                  1649
#define CLC3GLS1_D3T                  1650
#define LC3G2D3T                      1651
#define LC3G2D4N                      1652
#define CLC3GLS1_D4N                  1653
#define LC3G2D4T                      1654
#define CLC3GLS1_D4T                  1655
#define CLC3GLS2                      1656
#define LC3G3D1N                      1657
#define CLC3GLS2_D1N                  1658
#define LC3G3D1T                      1659
#define CLC3GLS2_D1T                  1660
#define CLC3GLS2_D2N                  1661
#define LC3G3D2N                      1662
#define CLC3GLS2_D2T                  1663
#define LC3G3D2T                      1664
#define CLC3GLS2_D3N                  1665
#define LC3G3D3N                      1666
#define LC3G3D3T                      1667
#define CLC3GLS2_D3T                  1668
#define CLC3GLS2_D4N                  1669
#define LC3G3D4N                      1670
#define CLC3GLS2_D4T                  1671
#define LC3G3D4T                      1672
#define CLC3GLS3                      1673
#define LC3G4D1N                      1674
#define CLC3GLS3_G4D1N                1675
#define LC3G4D1T                      1676
#define CLC3GLS3_G4D1T                1677
#define LC3G4D2N                      1678
#define CLC3GLS3_G4D2N                1679
#define CLC3GLS3_G4D2T                1680
#define LC3G4D2T                      1681
#define LC3G4D3N                      1682
#define CLC3GLS3_G4D3N                1683
#define CLC3GLS3_G4D3T                1684
#define LC3G4D3T                      1685
#define LC3G4D4N                      1686
#define CLC3GLS3_G4D4N                1687
#define LC3G4D4T                      1688
#define CLC3GLS3_G4D4T                1689
#define CLC4CON                       1690
#define LC4MODE                       1691
#define CLC4CON_MODE                  1692
#define LC4MODE0                      1693
#define CLC4CON_MODE0                 1694
#define LC4MODE1                      1695
#define CLC4CON_MODE1                 1696
#define LC4MODE2                      1697
#define CLC4CON_MODE2                 1698
#define LC4INTN                       1699
#define CLC4CON_INTN                  1700
#define CLC4CON_INTP                  1701
#define LC4INTP                       1702
#define CLC4CON_OUT                   1703
#define LC4OUT                        1704
#define CLC4CON_EN                    1705
#define LC4EN                         1706
#define CLC4POL                       1707
#define CLC4POL_G1POL                 1708
#define LC4G1POL                      1709
#define CLC4POL_G2POL                 1710
#define LC4G2POL                      1711
#define CLC4POL_G3POL                 1712
#define LC4G3POL                      1713
#define LC4G4POL                      1714
#define CLC4POL_G4POL                 1715
#define LC4POL                        1716
#define CLC4POL_POL                   1717
#define CLC4SEL0                      1718
#define CLC4SEL0_D1S0                 1719
#define LC4D1S0                       1720
#define CLC4SEL0_D1S                  1721
#define LC4D1S                        1722
#define CLC4SEL0_D1S1                 1723
#define LC4D1S1                       1724
#define CLC4SEL0_D1S2                 1725
#define LC4D1S2                       1726
#define CLC4SEL0_D1S3                 1727
#define LC4D1S3                       1728
#define CLC4SEL0_D1S4                 1729
#define LC4D1S4                       1730
#define CLC4SEL1                      1731
#define LC4D2S                        1732
#define LC4D2S0                       1733
#define CLC4SEL1_D2S                  1734
#define CLC4SEL1_D2S0                 1735
#define LC4D2S1                       1736
#define CLC4SEL1_D2S1                 1737
#define LC4D2S2                       1738
#define CLC4SEL1_D2S2                 1739
#define LC4D2S3                       1740
#define CLC4SEL1_D2S3                 1741
#define LC4D2S4                       1742
#define CLC4SEL1_D2S4                 1743
#define CLC4SEL2                      1744
#define LC4D3S                        1745
#define CLC4SEL2_D3S                  1746
#define CLC4SEL2_D3S0                 1747
#define LC4D3S0                       1748
#define LC4D3S1                       1749
#define CLC4SEL2_D3S1                 1750
#define CLC4SEL2_D3S2                 1751
#define LC4D3S2                       1752
#define CLC4SEL2_D3S3                 1753
#define LC4D3S3                       1754
#define LC4D3S4                       1755
#define CLC4SEL2_D3S4                 1756
#define CLC4SEL3                      1757
#define LC4D4S0                       1758
#define LC4D4S                        1759
#define CLC4SEL3_D4S0                 1760
#define CLC4SEL3_D4S                  1761
#define LC4D4S1                       1762
#define CLC4SEL3_D4S1                 1763
#define LC4D4S2                       1764
#define CLC4SEL3_D4S2                 1765
#define LC4D4S3                       1766
#define CLC4SEL3_D4S3                 1767
#define LC4D4S4                       1768
#define CLC4SEL3_D4S4                 1769
#define CLC4GLS0                      1770
#define CLC4GLS0_D1N                  1771
#define LC4G1D1N                      1772
#define CLC4GLS0_D1T                  1773
#define LC4G1D1T                      1774
#define CLC4GLS0_D2N                  1775
#define LC4G1D2N                      1776
#define CLC4GLS0_D2T                  1777
#define LC4G1D2T                      1778
#define CLC4GLS0_D3N                  1779
#define LC4G1D3N                      1780
#define CLC4GLS0_D3T                  1781
#define LC4G1D3T                      1782
#define CLC4GLS0_D4N                  1783
#define LC4G1D4N                      1784
#define CLC4GLS0_D4T                  1785
#define LC4G1D4T                      1786
#define CLC4GLS1                      1787
#define CLC4GLS1_D1N                  1788
#define LC4G2D1N                      1789
#define CLC4GLS1_D1T                  1790
#define LC4G2D1T                      1791
#define LC4G2D2N                      1792
#define CLC4GLS1_D2N                  1793
#define LC4G2D2T                      1794
#define CLC4GLS1_D2T                  1795
#define CLC4GLS1_D3N                  1796
#define LC4G2D3N                      1797
#define LC4G2D3T                      1798
#define CLC4GLS1_D3T                  1799
#define CLC4GLS1_D4N                  1800
#define LC4G2D4N                      1801
#define CLC4GLS1_D4T                  1802
#define LC4G2D4T                      1803
#define CLC4GLS2                      1804
#define CLC4GLS2_D1N                  1805
#define LC4G3D1N                      1806
#define CLC4GLS2_D1T                  1807
#define LC4G3D1T                      1808
#define LC4G3D2N                      1809
#define CLC4GLS2_D2N                  1810
#define LC4G3D2T                      1811
#define CLC4GLS2_D2T                  1812
#define CLC4GLS2_D3N                  1813
#define LC4G3D3N                      1814
#define CLC4GLS2_D3T                  1815
#define LC4G3D3T                      1816
#define LC4G3D4N                      1817
#define CLC4GLS2_D4N                  1818
#define LC4G3D4T                      1819
#define CLC4GLS2_D4T                  1820
#define CLC4GLS3                      1821
#define CLC4GLS3_G4D1N                1822
#define LC4G4D1N                      1823
#define LC4G4D1T                      1824
#define CLC4GLS3_G4D1T                1825
#define LC4G4D2N                      1826
#define CLC4GLS3_G4D2N                1827
#define LC4G4D2T                      1828
#define CLC4GLS3_G4D2T                1829
#define CLC4GLS3_G4D3N                1830
#define LC4G4D3N                      1831
#define CLC4GLS3_G4D3T                1832
#define LC4G4D3T                      1833
#define LC4G4D4N                      1834
#define CLC4GLS3_G4D4N                1835
#define LC4G4D4T                      1836
#define CLC4GLS3_G4D4T                1837
#define STATUS_SHAD                   1838
#define C_SHAD                        1839
#define DC_SHAD                       1840
#define Z_SHAD                        1841
#define WREG_SHAD                     1842
#define BSR_SHAD                      1843
#define PCLATH_SHAD                   1844
#define FSR0L_SHAD                    1845
#define FSR0H_SHAD                    1846
#define FSR1L_SHAD                    1847
#define FSR1H_SHAD                    1848
#define STKPTR                        1849
#define TOSL                          1850
#define TOSH                          1851

#endif // _PIC16LF1719_H_
